---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ConduitRun
source: html/dc6834b9-9cd1-4b9f-a15b-bbc4d8d7127d.htm
---
# ConduitRun Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.